jmeter/testplans/gateway_rs_hellotea.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="teapot2-plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="with access token" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">700</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Use manually inserted access token" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJHVGZ5eG9HVTBjbGxobzhnX3U1SGcwajNucUtjUjdwMUgzS2xXNi1BQTRBIn0.eyJleHAiOjE2ODgzMzc2MTgsImlhdCI6MTY4ODMwMTYxOCwianRpIjoiZGRiZmJmNmItMTc3Yy00ZmNmLThiMjAtOGNiOTRlNmM1OGQwIiwiaXNzIjoiaHR0cDovL2hvc3QuZG9ja2VyLmludGVybmFsOjEwMDAxL3JlYWxtcy90ZWFwb3QiLCJhdWQiOiJ0ZWEiLCJzdWIiOiI5ZGI1NzI3My1mNDVkLTQ0MGYtOTEwZS04ZGM3NjRjM2JjYjAiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJ0ZWFwb3QtZ2F0ZXdheSIsInNlc3Npb25fc3RhdGUiOiJiMGJlOTQ3Yi1kODI1LTQ1M2QtYTYzYy0yNDJmZjk4Y2Y1ZmIiLCJhY3IiOiIxIiwiYWxsb3dlZC1vcmlnaW5zIjpbIioiXSwicmVhbG1fYWNjZXNzIjp7InJvbGVzIjpbInRlYV9hZG1pbiIsIm9mZmxpbmVfYWNjZXNzIiwidW1hX2F1dGhvcml6YXRpb24iLCJkZWZhdWx0LXJvbGVzLXRlYXBvdCIsInRlYV91c2VyIl19LCJyZXNvdXJjZV9hY2Nlc3MiOnsidGVhcG90LWdhdGV3YXkiOnsicm9sZXMiOlsicHJpdmlsZWdlZF91c2VyIiwiYWRtaW4iLCJ1c2VyIl19fSwic2NvcGUiOiJvcGVuaWQgdGVhX3JlYWQgcHJvZmlsZSB0ZWEiLCJzaWQiOiJiMGJlOTQ3Yi1kODI1LTQ1M2QtYTYzYy0yNDJmZjk4Y2Y1ZmIiLCJuYW1lIjoiVXJzdWxhIFJhdWNoIiwicHJlZmVycmVkX3VzZXJuYW1lIjoidWxhIiwiZ2l2ZW5fbmFtZSI6IlVyc3VsYSIsImZhbWlseV9uYW1lIjoiUmF1Y2gifQ.PgE-HAfuU5zlb40jPtBdtqq4o6w00hWktzt1oH91o5drnw1hldIh6WrRBLvrSzSMJoQdu7O1SBug7Se2VJ3JaTvWgziwQ0UccmCCEzMEQA1AtASjEGbb5pwOkK8P1wR6dZrTtPMO-_vVaCIv0JXRj8htKFIpHF3PUMj2lRcvpB63BZtZIU65K7eoU9SiFbw1OqgbCAG9lwOJT1dbLcPoAt5WjbzFoDSewZ2YeVhTRvx566MqroCBgitlRwBTfnh5dYw6FOy3m7uZHLUFwKwom_vexHgJy1kUp1wWAgDw0Yfbpu90gQN3ONW78ffE7vN7Zw0q4xwkDy_vjsae21aInw</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="gateway_rs/hellotea" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8180</stringProp>
          <stringProp name="HTTPSampler.path">hellotea/tea</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">C:\Users\Ula\Documents\FH\WFP_BA\BA2\teapot2-new\jmeter-tests\results\hellotea-rs\teapottests-gatewayRsHellotea-700.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="false">
        <collectionProp name="Arguments.arguments">
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>